In [3]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [5]:
df1=pd.DataFrame({"data": [4,8,15,16,23,42]})

   data
0     4
1     8
2    15
3    16
4    23
5    42

In [6]:
""" Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it."""

' Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the\nvariable print it.'

In [7]:
list1= [1,2,3,5,6,7,9,10,11,12]

In [18]:
series1= pd.Series(list1)

In [20]:
series1

0     1
1     2
2     3
3     5
4     6
5     7
6     9
7    10
8    11
9    12
dtype: int64

In [9]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
df2= pd.DataFrame({"Name": ["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [14]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [15]:
"""In pandas, a DataFrame is a two-dimensional labeled data structure that consists of columns.
On the other hand, a Series is a one-dimensional labeled array that can hold any data type"""

'In pandas, a DataFrame is a two-dimensional labeled data structure that consists of columns.\nOn the other hand, a Series is a one-dimensional labeled array that can hold any data type'

In [16]:
df2 # example of series

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
series1 # example of series

0     1
1     2
2     3
3     5
4     6
5     7
6     9
7    10
8    11
9    12
dtype: int64

In [21]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?"""

'Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can\nyou give an example of when you might use one of these functions?'

In [23]:
""" Here are the common manupulating functions in Pandas dataframe with examples"""

' Here are the common manupulating functions in Pandas dataframe with examples'

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [24]:
df2.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
df2.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [26]:
df2.value_counts()

Name    Age  Gender
Alice   25   Female    1
Bob     30   Male      1
Claire  27   Female    1
dtype: int64

In [31]:
df2.sort_values("Age")

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [32]:
# group_by

In [60]:
df2.replace(25,31)

     Name  Age  Gender
0   Alice    0  Female
1     Bob   30    Male
2  Claire   27  Female

In [55]:
df2.fillna("not_given")

     Name  Age  Gender
0   Alice    0  Female
1     Bob   30    Male
2  Claire   27  Female

In [58]:
df2

     Name  Age  Gender
0   Alice    0  Female
1     Bob   30    Male
2  Claire   27  Female

In [62]:
df2.drop(["Age"],axis =1)

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [63]:
"""both Series and DataFrame are mutable in nature, while Panel is not mutable."""

'both Series and DataFrame are mutable in nature, while Panel is not mutable.'

In [64]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [66]:
import pandas as pd
name_series = pd.Series(['John', 'Alice', 'Bob'])
age_series = pd.Series([25, 28, 32])
city_series = pd.Series(['New York', 'London', 'Paris'])


data = {'Name': name_series, 'Age': age_series, 'City': city_series}
df = pd.DataFrame(data)